CSI API ETABS v1
cPropMaterial.SetWeightAndMass Method
 Assigns weight per unit volume or mass per unit volume to a material property.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetWeightAndMass(
	string Name,
	int MyOption,
	double Value,
	double Temp = 0
)
Function SetWeightAndMass (
	Name As String,
	MyOption As Integer,
	Value As Double,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim MyOption As Integer
Dim Value As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.SetWeightAndMass(Name,
	MyOption, Value, Temp)
int SetWeightAndMass(
	String^ Name,
	int MyOption,
	double Value,
	double Temp = 0
)
abstract SetWeightAndMass :
        Name : string *
        MyOption : int *
        Value : float *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing material property.
MyOption
Type: System.Int32
This is either 1 or 2, indicating what is specified by the Value item.
Value | Option
1 | Weight per unit volume is specified
2 | Mass per unit volume is specified
Value
Type: System.Double
This is either the weight per unit volume or the mass per unit volume, depending on the value of the MyOption item. [F/L3] for MyOption = 1 (weight), and [M/L3] for MyOption = 2 (mass)
Temp (Optional)
Type: System.Double
Return Value
Type: Int32
Returns zero if the data is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'initialize new material property
       ret = SapModel.PropMaterial.SetMaterial("Steel", eMatType.Steel)
   'assign material property weight per unit volume
       ret = SapModel.PropMaterial.SetWeightAndMass("Steel", 1, 0.00029)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace